package com.james.demo.regex;

import java.util.regex.Matcher;
import java.util.regex.Pattern;

public class ContentExtracter {
    public static void main(String[] args) {
        String str = "SUN公司被Oracle收购，是否意味着java被逼上了死路？";
        String s = "\\d+.\\d+|\\w+";
        Pattern pattern = Pattern.compile(s);
        Matcher ma = pattern.matcher(str);

        while (ma.find()) {
            System.out.println(ma.group());
        }

        System.out.println("\n---------------------------------------\n");

        String srcString = "企业负担不断减轻\n" + "\n"
                + "　　“前三季度的财政收支运行平稳，和当期经济形势相互协调，积极财政政策不断加力增效，有力促进了经济增长。”中国财政科学研究院副院长白景明说。\n" + "\n"
                + "　　在税收数据中，最引人关注的是营改增带来的减税效果。据统计，今年1月至9月份，国内增值税28014亿元，同比增长23.8%。主要是全面推开营改增试点后，原营业税纳税人改缴增值税形成收入转移且体现增收。其中，国内增值税（不含改征增值税）增长2.7%。营业税11405亿元，同比下降20.4%，主要是全面推开营改增试点后，原营业税纳税人改缴增值税，收入在增值税科目中反映，体现为增值税增收、营业税减收。\n"
                + "\n"
                + "　　“考虑收入在税种间转移因素，将改征增值税与营业税合并计算，前三季度累计增长11.4%，其中上半年增长24.2%，7、8、9月则分别下降10.9%、17.6%、21.3%，全面推开营改增试点的政策性减收效应逐步体现。”财政部有关负责人表示。\n"
                + "\n"
                + "　　据此前国家税务总局发布的统计数据，今年1月至7月份营改增整体减税共计2107亿元。“营改增不仅是我国税收制度的重要变革，同时承担起减轻企业税收负担，促进经济发展方式转变的历史重任。全面实施服务业营改增，使税制适应并促进了我国经济结构优化、产业层次提升、企业转型发展、服务贸易增强，为可持续发展提供了动力。”上海财经大学公共政策与治理研究院院长胡怡建说。\n"
                + "\n" + "　　房地产税收涨幅大\n" + "\n"
                + "　　除了营改增，前三季度税收收入的另一突出特点是房地产相关税收涨幅较大。数据显示，前三季度房地产企业所得税3035亿元，增长25.4%；个人所得税7903亿元，同比增长17%，其中，受二手房交易活跃等带动，财产转让所得税增长27.2%；契税3158亿元，同比增长11.7%；土地增值税3280亿元，同比增长13.7%。";
        String p = "[0-9]+\\.[0-9]+%";
        Pattern patt = Pattern.compile(p);
        Matcher matcher = patt.matcher(srcString);

        while (matcher.find()) {
            System.out.println(matcher.group());
        }

    }
}
